#Задание 1
#Напишите функцию, которая отображает на экран
#форматированный текст, указанный ниже:
#“Don't compare yourself with anyone in this world…
#if you do so, you are insulting yourself.”
#Bill Gates
#def text ():
#    print(f" “Don't compare yourself with anyone in this world…\nif you do so, you are insulting yourself.”"
#          f"\nBill Gates")
#text()

#Задание 2
#Напишите функцию, которая принимает два числа
#в качестве параметра и отображает все четные числа
#ежду ними.
#def funct_even (start : int, end : int):
#     for i in range(min(start, end), max(start, end)):
#         if i % 2 == 0:
#             print(i)
#funct_even(4,21)
#funct_even(21,4)

#Задание 3
#Напишите функцию, которая отображает пустой или
#заполненный квадрат из некоторого символа. Функция
#принимает в качестве параметров: длину стороны квадрата, символ и переменную логического типа:
#■ если она равна True, квадрат заполненный;
#■ если False, квадрат пустой.

#Задание 4
#Напишите функцию, которая возвращает минимальное
#из пяти чисел. Числа передаются в качестве параметров.
#def five (a, b, c, d, e):
#    return min(a, b, c, d, e)
#
#five (1, 4, 5, 2, 7)

#Задание 5
#Напишите функцию, которая возвращает произведение чисел в указанном диапазоне. Границы диапазона
#передаются в качестве параметров. Если границы диапазона перепутаны (например, 5 — верхняя граница, 25 —
#нижняя граница), их нужно поменять местами.
#def multiplication(a, b):
#    if a == b:
#        return 'Диапазон введен неверно'
#    if a > b:
#        a, b == b, a
#    result = 1
#    for i in range(a, b + 1):
#        result *= i
#    return result
#print(multiplication(int(input("Введите a: ")), int(input("Введите b: "))))

#Задание 6
#Напишите функцию, которая считает количество
#цифр в числе. Число передаётся в качестве параметра. Из
#функции нужно вернуть полученное количество цифр.
#Например, если передали 3456, количество цифр будет 4
#def quantity(a):
#    result = 0
#    for i in range(len(str(a))):
#        result += 1
#    return result
#
#print('Количество цифр в числе 3452 = ', quantity(3452))

