#Задание 2
#Показать на экране таблицу умножения для всех чисел
#от 1 до 10
#i = 1
#while i <= 10:
#    j = 1
#    while j <= 10:
#        print(f'{i} * {j} = {i * j}', end = '\t')
#        j += 1
#    print()
#    i += 1

#Задание 1
#Показать на экран все простые числа в диапазоне,
#указанном пользователем. Число называется простым,
#если оно делится без остатка только на себя и на единицу.
#Например, три — это простое число, а четыре нет
#a = int(input('Введите число: '))
#b = int(input('Введите число: '))
#
#for i in range(a,b):
#    count = 0
#    d = 2
#    while d < i:                        #подсмотрел решение в интернете
#        if i % d == 0:
#            count += 1
#        d += 1
#    if count == 0:
#        print(f'{i} простое число')

#Задание 3
#Показать на экран таблицу умножения в диапазоне,
#указанном пользователем. Например, если пользователь
#указал 3 и 5, таблица может выглядеть так
#3*1 = 3 3*2 = 6 3*3 = 9 ... 3 * 10 = 30
#".....................................................................................
#5*1 = 5 5 *2 = 10 5 *3 = 15 ... 5 * 10 = 50
#a = int(input('Введите начало диапазона: '))
#b = int(input('Введите конец диапазона: '))
#i = a
#while i <= b:
#    j = 1
#    while j <= 10:
#        print(f'{i} * {j} = {i * j}', end = ' \t')
#        j += 1
#    print()
#    i += 1

print('hello')