#Задание 1
#Пользователь вводит с клавиатуры два числа. Нужно
#посчитать отдельно сумму четных, нечетных и чисел,
#кратных 9 в указанном диапазоне, а также среднеарифметическое каждой группы.

#a=int(input('Введите первое число: '))
#b=int(input('Введите второе число: '))
#sum_even_numbers=0
#sum_odd_numbers=0
#average=0
#for i in range(a,b):
#    if i % 2 == 0:
#        sum_even_numbers += i
#    if i % 2 != 0:
#        sum_odd_numbers += i
#    if i % 9 == 0:
#        average += i
#print("Сумма четных: ", sum_even_numbers)
#print("Сумма нечетных: ", sum_odd_numbers)
#print("Сумма кратных 9: ", average)

#Задание 2
#Пользователь вводит с клавиатуры длину линии и
#символ для заполнения линии. Нужно отобразить на
#экране вертикальную линию из введенного символа,
#указанной длины.
#Например, если было введено 5 и символ %, тогда
#вывод на экран будет такой:
#%
#%
#%
#%
#%
#length = int(input('Введите длину линии: '))
#symbol = input('Введите желаемый символ: ')
#i = 0
#while i < length:
#    print(symbol)
#    i += 1

#Задание 3
#Пользователь вводит с клавиатуры числа. Если число
#больше нуля нужно вывести надпись «Number is positive»,
#Домашнее задание
#1
#если меньше нуля «Number is negative», если равно нулю
#«Number is equal to zero». Когда пользователь вводит
#число 7 программа прекращает свою работу и выводит
#на экран надпись «Good bye!»

#n = 0
#n_more = 1
#n_less = 1
#while True:
#    a = int(input('Вводите числа: '))
#    if a == 7:
#        print('Good bye')
#        break
#    elif a > 0:
#        print('Number is positive')
#    elif a < 0:
#        print('Number is negative')
#    elif a == 0:
#        print('Number is equal to zero')

#Задание 4
#Пользователь вводит с клавиатуры числа. Программа должна подсчитывать сумму, максимум и минимум,
#введенных чисел. Когда пользователь вводит число 7
#программа прекращает свою работу и выводит на экран
#надпись «Good bye!
#i = 0
#i_max = 1
#i_min = 1
#while True:
#    a = int(input("Вводите числа: "))
#    if a == 7:
#        print('Good bye!')
#        break
#    elif a > i_max:
#        i_max = a
#    elif a < i_min:
#        i_min = a
#    i = i + a
#
#print('Сумма введенных чисел равна: ', i)
#print('Максиммальное введеное число: - ', i_max)
#print('Минимальное введеное число: ', i_min)







