#Задание 1
#Напишите программу, которая запрашивает два
#целых числа x и y, после чего вычисляет и выводит
#значение x в степени y.

#x = int(input('Введите первое число: '))
#y = int(input('Введите второе число: '))
#degree = x ** y
#print(degree)

#Задание 2
#Подсчитать количество целых чисел в диапазоне от
#100 до 999 у которых есть две одинаковые цифры.
#count = 0
#for i in range(100, 1000):
#    first = i // 100
#    second = i // 10 % 10
#    third = i % 10
#    if (first == second and first != third) or (first == third and first != second) or (second == third and second != first):
#        count += 1
#print(count)

#адание 3
#подсчитать количество целых чисел в диапазоне от
#100 до 9999 у которых все цифры разные.
#count1 = 0
#count2 = 0
#for i in range (1000, 10000):
#    first = i // 1000
#    second = i // 100 % 10
#    third = i % 100 // 10
#    fourth = i % 10
#    if first != second and first != third and first != fourth and second != third and second != fourth and third != fourth:
#        count1 += 1
#for i in range (100, 1000):
#    first = i // 100
#    second = i // 10 % 10
#    third = i % 10
#    if first != second and first != third and second != third:
#        count2 += 1
#print(count1 + count2)

#Задание 4
#Пользователь вводит любое целое число. Необходимо из этого целого числа удалить все цифры 3 и 6 и
#вывести обратно на экран.





